# Working with MySql using sqlalchemy

### method1: Direct Connection

In [6]:
import os

os.chdir("E:/code/5.DataAnalysisOfficial/data")
os.getcwd()

'E:\\code\\5.DataAnalysisOfficial\\data'

In [7]:
#!pip install pymysql

In [8]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd


engine = create_engine("mysql+pymysql://root:root@127.0.0.1:3306/organization")
#                                       uname /pwd/hostname/port no./db name
con = engine.connect()
rs = con.execute("select * from student")
df = pd.DataFrame(data=rs.fetchall(), columns=rs.keys())
df.head()
con.close()

In [9]:
df.head()

   sid firstname lastname  age   qual branch phone
0    1     pavan    kumar   24  btech   mech  8143
1    2    janaki      ram   26  btech   mech  9700
2    3     surya    kiran   29  mtech    ece  9742
3    4      jhan    shara   26  btech    cse  9951
4    5     vijay    kiran   28  btech    cse  8125

### method2: with conjugate

In [10]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

engine = create_engine("mysql+pymysql://root:root@127.0.0.1:3306/organization")
with engine.connect() as con:
    rs = con.execute("select * from student")
    df = pd.DataFrame(data=rs.fetchall(), columns=rs.keys())
df.head()

   sid firstname lastname  age   qual branch phone
0    1     pavan    kumar   24  btech   mech  8143
1    2    janaki      ram   26  btech   mech  9700
2    3     surya    kiran   29  mtech    ece  9742
3    4      jhan    shara   26  btech    cse  9951
4    5     vijay    kiran   28  btech    cse  8125

### method3: using pandas

In [12]:
from sqlalchemy import create_engine;import pandas as pd

engine = create_engine("mysql+pymysql://root:root@localhost:3306/organization")
con = engine.connect()
query = "insert into student(sid,firstname, lastname, age, qual, branch, phone) values(14,'asdf', 'asdfas',25, 'efth', 'rytkg', 8523)"
con.execute(query)

In [15]:
query2 = "delete from student where firstname='asdf'"
con.execute(query2)

In [16]:
pd.read_sql("select * from student",con)

   sid firstname lastname  age   qual branch phone
0    1     pavan    kumar   24  btech   mech  8143
1    2    janaki      ram   26  btech   mech  9700
2    3     surya    kiran   29  mtech    ece  9742
3    4      jhan    shara   26  btech    cse  9951
4    5     vijay    kiran   28  btech    cse  8125
5    6      teja     naga   25  btech    cse  9912
6    7   sudheer  aravind   29    mba  finan  9133
7    8     swamy    kumar   29    mba  finan  9848
8    9     pavan   kalyan   42    ssc    eee  1234
9   10     pavan   kalyan   42    ssc    eee  1234

## 2.Working with MySql connector package

In [10]:
# If pkg not available then install it 
# conda install -c anaconda mysql-connector-python

import mysql.connector
import pandas as pd

#mydb = mysql.connector.connect(user="root",passwd="root",
                               #host="127.0.0.1",database="organization")
#rs = mydb.cursor()

In [11]:
#rs.execute("select * from student")
#df = pd.DataFrame(data=rs.fetchall(), columns=rs.column_names)
#df.head()